ninety-nine-cats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Not Angela"], ["description", ""], ["updated_at", "2023-02-18 17:13:13.570669"], ["id", 3]]